Revit 2027 API
BuiltInFailures.RebarSystemFailures.CannotUsePathReinforcementHookTypeStyle Property
 At least one of the bars in the Path Reinforcement has a Bar Type or Shape that is incompatible with the Hook type. Check the Hook permissions for the Bar Type (see Hook Lengths) and the Hook and Rebar Shape styles.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId CannotUsePathReinforcementHookTypeStyle { get; }
Public Shared ReadOnly Property CannotUsePathReinforcementHookTypeStyle As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ CannotUsePathReinforcementHookTypeStyle {
	FailureDefinitionId^ get ();
}
static member CannotUsePathReinforcementHookTypeStyle : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.RebarSystemFailures Class
Autodesk.Revit.DB Namespace